namespace OnlineShop.Migrations
{
    using System;
    using System.Data.Entity.Migrations;
    
    public partial class NewSkirtsAreAdded : DbMigration
    {
        public override void Up()
        {
            Sql(@"insert into Item(SubCategoryId,Title,Desciption,Price,ColorId) values
                (4,N'دامن کوتاه دکمه‌دار',N'یکی از شیک ترین انتخاب های دنیای مد امروزی دامن است، اما انتخاب مدل دامن بستگی زیادی به اندام هر فرد دارد.',54000 ,9),
                (4,N'دامن کوتاه',N'یکی از شیک ترین انتخاب های دنیای مد امروزی دامن است، اما انتخاب مدل دامن بستگی زیادی به اندام هر فرد دارد.',66000 ,9),
                (4,N'دامن چرم ',N'یکی از شیک ترین انتخاب های دنیای مد امروزی دامن است، اما انتخاب مدل دامن بستگی زیادی به اندام هر فرد دارد.',70000 ,9),
                (4,N'دامن رسمی',N'یکی از شیک ترین انتخاب های دنیای مد امروزی دامن است، اما انتخاب مدل دامن بستگی زیادی به اندام هر فرد دارد.',89000 ,2),
                (4,N'دامن کوتاه چهارخونه',N'یکی از شیک ترین انتخاب های دنیای مد امروزی دامن است، اما انتخاب مدل دامن بستگی زیادی به اندام هر فرد دارد.',120000,12),
                (4,N'دامن جین ',N'یکی از شیک ترین انتخاب های دنیای مد امروزی دامن است، اما انتخاب مدل دامن بستگی زیادی به اندام هر فرد دارد.',99000 ,1),
                (4,N'دامن بلند چهارخونه',N'یکی از شیک ترین انتخاب های دنیای مد امروزی دامن است، اما انتخاب مدل دامن بستگی زیادی به اندام هر فرد دارد.',67000 ,13),
                (4,N'دامن کوتاه',N'یکی از شیک ترین انتخاب های دنیای مد امروزی دامن است، اما انتخاب مدل دامن بستگی زیادی به اندام هر فرد دارد.',87000 ,12),
                (4,N'دامن بلند دکمه‌دار',N'یکی از شیک ترین انتخاب های دنیای مد امروزی دامن است، اما انتخاب مدل دامن بستگی زیادی به اندام هر فرد دارد.',77000 ,3),
                (4,N'دامن کوتاه روشن',N'یکی از شیک ترین انتخاب های دنیای مد امروزی دامن است، اما انتخاب مدل دامن بستگی زیادی به اندام هر فرد دارد.',95000 ,10)");
        }
        
        public override void Down()
        {
        }
    }
}
